cypress/artillery/zadanie_artillery.yml
config:
  target: https://http.cat/
  phases:
    - duration: 1
      arrivalRate: 1
      name: Artillery Zadanie domowe
  payload:
    -
      path: "keywords.csv"
      fields:
        - "keyword1"
        - "keyword2"
      order: sequence
  plugins:
    ensure: {}
  ensure:
    thresholds:
      - http.response_time.p95: 1000
    conditions:
      - expression: vusers.failed == 0
      - expression: http.request_rate >= 2 and http.response_time.max < 600
scenarios:
  - name: Getting a resource
    flow:
      - get:
          url: "{{ target }}get?param1={{ **keyword1** }}"
      - post:
          url: "{{ target }}post?param2={{ **keyword2** }}"
          json:
            username: Test User
            password: Temp Password
          capture:
            - json: $.json
              as: request_body
            - json: $.headers.Host
              as: host
      - log: "Json value from response is: {{request_body}}"
      - log: "Host value from response is: {{host}}"